projectsNL = '[ { "projectName": "UNO.js", "projectText": "Nadat UNO.js een leuk project bleek te zijn, heb ik een lange tijd nagedacht over welk ander bordspel ik kon omtoveren tot een web-versie ervan. Ik had besloten om een ander redelijk bekend bordspel na te maken, maar om er ook een draai aan te geven. Ik nam Yahtzee, maar voegde twee extra dobbelstenen toe, om Yahtzeven te creëren. Een van de redenen dat ik dit gekozen heb, is omdat het met de extra uitdaging kwam om een interactief scoreblad te maken.", "cardText": "Een web-versie van UNO, gemaakt met HTML/CSS en JavaScript!", "projectLanguages": [ "HTML", "CSS", "JavaScript" ], "projectTools": [ "Visual Studio Code", "Adobe Illustrator" ] }, { "projectName": "Yahtzeven", "projectText": "Nadat UNO.js een leuk project bleek te zijn, heb ik een lange tijd nagedacht over welk ander bordspel ik kon omtoveren tot een web-versie ervan. Ik had besloten om een ander redelijk bekend bordspel na te maken, maar om er ook een draai aan te geven. Ik nam Yahtzee, maar voegde twee extra dobbelstenen toe, om Yahtzeven te creëren. Een van de redenen dat ik dit gekozen heb, is omdat het met de extra uitdaging kwam om een interactief scoreblad te maken.", "cardText": "Een uitgebreide versie van Yahtzee!", "projectLanguages": [ "HTML", "CSS", "JavaScript" ], "projectTools": [ "Visual Studio Code", "Paint.NET" ] }, { "projectName": "Persoonlijke Website", "projectText": "Als deel van een andere opdracht tijdens mijn MBO-opleiding moesten we een persoonlijke website maken, in principe een overdreven “About Me”-pagina. Het was een goede manier om weer te wennen aan de flow van websites opbouwen, want op dat moment hadden we vooral nog gefocust op C#, en nog niet heel veel web development. Ik ben nog steeds zeer tevreden met hoe het er visueel uitziet, zelfs al is het niet het meest visueel indrukwekkende.", "cardText" : "Een persoonlijke website gemaakt om mijn HTML/CSS vaardigheden te testen!", "projectLanguages": [ "HTML", "CSS" ], "projectTools": [ "Visual Studio Code", "Paint.NET" ] }, { "projectName": "Pong", "projectText": "Ter introductie in spellen maken in Unity, hadden wij als taak om Pong te recreëren. Hoewel ik op dat moment al best wat ervaring had met C#, had ik toendertijd nog nooit met Unity gewerkt, en dit was een fijne introductie hiervoor. Ik ben in het algemeen vrij tevreden met hoe dit gelukt is, maar het is denk ik wel mijn meest “verouderde” project tot dusver.", "projectLanguages": [ "C#" ], "projectTools": [ "Unity", "Visual Studio", "Paint.NET" ] } ]'