projectsEN = '[ { "projectName": "UNO.js", "projectText": "As an assignment in college, a personal project I chose to do, to show off my skills in HTML/CSS and JS, I created an in-browser version of the popular card game UNO.<br>Alongside this, I tried to focus on both a mobile-accessible and a desktop version, and learned quite a lot about how to work with the languages I worked in.", "cardText": "cardTest", "projectLanguages": [ "HTML", "CSS", "JavaScript" ], "projectTools": [ "Visual Studio Code", "Adobe Illustrator" ] }, { "projectName": "Yahtseven", "projectText": "After UNO.js turned out to be as fun a project as it was, I spent a while thinking about another tabletop game I could make a web-based version of. I decided to create another relatively well-known tabletop game, but this time I put a spin on it. I took Yahtzee, but added two more dice, to create Yahtseven. One reason I chose this, is because it came with the challenge of creating an interactive scorecard.", "cardText": "cardTest", "projectLanguages": [ "HTML", "CSS", "JavaScript" ], "projectTools": [ "Visual Studio Code", "Paint.NET" ] }, { "projectName": "Personal Website", "projectText": "As part of another college assignment, we were asked to create a personal website of our own making, basically a glorified about me website. It was a good way to get back into the flow of things, as at that point we had mainly been focusing on C# and other things, and not a whole lot of web development yet. I still really like how it turned out visually, even if it is not necessarily the most visually impressive.", "cardText": "cardTest", "projectLanguages": [ "HTML", "CSS" ], "projectTools": [ "Visual Studio Code", "Paint.NET" ] }, { "projectName": "Pong", "projectText": "As an introduction to making games in Unity, we were tasked with recreating Pong. While at this point I had plenty of experience programming in C#, I had never touched Unity before, so this was a great introduction to it. In general I am pretty happy with how it turned out, though all things considered it is definitely the most outdated of the projects thus far.", "cardText": "cardTest", "projectLanguages": [ "C#" ], "projectTools": [ "Unity", "Visual Studio", "Paint.NET" ] } ]'